Documents/УправлениеУслугами.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Document>
		<Properties>
			<Name>УправлениеУслугами</Name>
			<BasedOn>
				<xr:Item>Catalog.ЛицевыеСчета</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.НазначенныеУслугиПодробно</xr:Item>
				<xr:Item>InformationRegister.НазначенныеУслуги</xr:Item>
				<xr:Item>InformationRegister.КачествоУслуг</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийУправленияУслугами</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Здание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗданияИСооружения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоэффициентКачества</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФильтрПоУслуге</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ЛицевыеСчета</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЛицевойСчет</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Услуги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Услуги</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/НазначенныеУслуги.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>НазначенныеУслуги</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Действует</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Услуги</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ВидыОперацийУправленияУслугами.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>ВидыОперацийУправленияУслугами</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НазначениеУслуги</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтключениеУслуги</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриостановкаУслуги</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВременноеНазначениеУслуги</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзменениеКачестваУслуг</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/УправлениеУслугами/Ext/ObjectModule.bsl
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

// Процедура - обработчик события ПередЗаписью объекта.
//
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ВидОперации = Перечисления.ВидыОперацийУправленияУслугами.НазначениеУслуги Тогда
		ДатаОкончания = '00010101';
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийУправленияУслугами.ОтключениеУслуги Тогда
		ДатаНачала = '00010101';
	КонецЕсли; 
	
КонецПроцедуры

// Процедура - обработчик события ОбработкаПроведения объекта.
//
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// Инициализация дополнительных свойств для проведения документа.
	ПроведениеСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
	
	// Инициализация данных документа.
	Документы.УправлениеУслугами.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);
	
	// Подготовка наборов записей.
	ПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	// Отражение в разделах учета.
	Если ВидОперации = Перечисления.ВидыОперацийУправленияУслугами.ИзменениеКачестваУслуг Тогда
		ПроведениеСервер.ОтразитьКачествоУслуг(ДополнительныеСвойства, Движения, Отказ);
	Иначе	
		ПроведениеСервер.ОтразитьНазначенныеУслуги(ДополнительныеСвойства, Движения, Отказ);
	КонецЕсли;	
	
	// Запись наборов записей.
	ПроведениеСервер.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	
	ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц.Закрыть();
	
	//Если ЭтотОбъект.ВидОперации = Перечисления.ВидыОперацийУправленияУслугами.ОтключениеУслуги Тогда
	//	Для Каждого стрЛС Из ЭтотОбъект.ЛицевыеСчета Цикл
	//		Для Каждого стр Из ЭтотОбъект.Услуги Цикл
	//			Запрос = Новый Запрос;
	//			Запрос.Текст =
	//			    "ВЫБРАТЬ
	//			    |	НазначенныеУслуги.Регистратор,
	//			    |	НазначенныеУслуги.Организация,
	//			    |	НазначенныеУслуги.ЛицевойСчет,
	//			    |	НазначенныеУслуги.Услуга,
	//			    |	НазначенныеУслуги.Действует
	//			    |ИЗ
	//			    |	РегистрСведений.НазначенныеУслуги КАК НазначенныеУслуги
	//			    |ГДЕ
	//			    |	НазначенныеУслуги.ЛицевойСчет = &ЛицевойСчет
	//			    |	И НазначенныеУслуги.Услуга = &Услуга
	//			    |	И НазначенныеУслуги.Действует = ИСТИНА";
	//			Запрос.УстановитьПараметр("ЛицевойСчет", стрЛС.ЛицевойСчет);
	//			Запрос.УстановитьПараметр("Услуга", стр.Услуга);
	//			Рез = Запрос.Выполнить().Выгрузить();
	//		КонецЦикла;
	//	КонецЦикла;
	//	Для Каждого стрРез Из Рез Цикл
	//		УстановкаУслуг = стрРез.Регистратор.ПолучитьОбъект();
	//		НаборЗаписей = УстановкаУслуг.Движения.НазначенныеУслуги;
	//		НаборЗаписей.Прочитать();
	//		Для Каждого стрНабор Из НаборЗаписей Цикл
	//			стрНабор.Действует = Ложь;
	//			НаборЗаписей.Записать(Истина);
	//		КонецЦикла;
	//	КонецЦикла;
	//КонецЕсли;
КонецПроцедуры

// Процедура - обработчик события ОбработкаУдаленияПроведения объекта.
//
Процедура ОбработкаУдаленияПроведения(Отказ)
	
	// Инициализация дополнительных свойств для проведения документа
	ПроведениеСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
	
	// Подготовка наборов записей
	ПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	// Запись наборов записей
	ПроведениеСервер.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	
	Если ЭтотОбъект.ВидОперации = Перечисления.ВидыОперацийУправленияУслугами.ОтключениеУслуги Тогда
		Для Каждого стрЛС Из ЭтотОбъект.ЛицевыеСчета Цикл
			Для Каждого стр Из ЭтотОбъект.Услуги Цикл
				Запрос = Новый Запрос;
				Запрос.Текст =
				    "ВЫБРАТЬ
				    |	НазначенныеУслуги.Регистратор,
				    |	НазначенныеУслуги.Организация,
				    |	НазначенныеУслуги.ЛицевойСчет,
				    |	НазначенныеУслуги.Услуга,
				    |	НазначенныеУслуги.Действует
				    |ИЗ
				    |	РегистрСведений.НазначенныеУслуги КАК НазначенныеУслуги
				    |ГДЕ
				    |	НазначенныеУслуги.ЛицевойСчет = &ЛицевойСчет
				    |	И НазначенныеУслуги.Услуга = &Услуга
				    |	И НазначенныеУслуги.Действует = ЛОЖЬ";
				Запрос.УстановитьПараметр("ЛицевойСчет", стрЛС.ЛицевойСчет);
				Запрос.УстановитьПараметр("Услуга", стр.Услуга);
				Рез = Запрос.Выполнить().Выгрузить();
			КонецЦикла;
		КонецЦикла;
		Для Каждого стрРез Из Рез Цикл
			УстановкаУслуг = стрРез.Регистратор.ПолучитьОбъект();
			НаборЗаписей = УстановкаУслуг.Движения.НазначенныеУслуги;
			НаборЗаписей.Прочитать();
			Для Каждого стрНабор Из НаборЗаписей Цикл
				стрНабор.Действует = Истина;
				НаборЗаписей.Записать(Истина);
			КонецЦикла;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

// Процедура - обработчик события ОбработкаЗаполнения объекта.
//
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		
		Если ДанныеЗаполнения.Свойство("ВидОперации") Тогда
			ВидОперации = ДанныеЗаполнения.ВидОперации;
		КонецЕсли;
		Если ДанныеЗаполнения.Свойство("Организация") Тогда
			Организация = ДанныеЗаполнения.Организация;
		КонецЕсли;
		Если ДанныеЗаполнения.Свойство("Здание") Тогда
			Здание = ДанныеЗаполнения.Здание;
		КонецЕсли;
		Если ДанныеЗаполнения.Свойство("ЛицевойСчет") Тогда
			Если ЛицевыеСчета.Количество() = 0 Тогда
				НоваяСтрока = ЛицевыеСчета.Добавить();
				НоваяСтрока.ЛицевойСчет = ДанныеЗаполнения.ЛицевойСчет;
			Иначе
				ЛицевыеСчета[0].ЛицевойСчет = ДанныеЗаполнения.ЛицевойСчет;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
